examples/euler2d/calaf/0/sideBottomTopPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// These BCs are shared among all variables, so this file can then
// just be loaded by each variable.

bottomAndTop
{
    type empty;			
}

/*
top
{
    type empty;			
}

ground
{
    type empty;			
}
*/

sides
{
    type zeroGradient;
}

"proc.*"
{
    type            processor;
}

// ************************************************************************* //
