examples/euler2d/calaf/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2206                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    actuationDisk1CellSet;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            p1     (235.0 160.0 0.5);
            p2     (245.0 160.0 0.5);
            radius 40.0;
        }
    }
    {
        name    actuationDisk1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuationDisk1CellSet;
        }
    }

);
